Repository: zrr1999/rill
Catalog: Sources/RillUI/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# general.vocabularyDescription
source: Teach Rill names, project terms, and replacements for voice output.
zh_hans: 为 Rill 配置人名、项目术语和语音输出替换规则。

# general.vocabularyEmpty
source: No vocabulary rules yet.
zh_hans: 还没有词汇规则。

# general.vocabularyHotwordBehavior
source: Matching local Qwen runs use a bounded hotword context. Hotwords improve recognition probability but do not guarantee a match.
zh_hans: 范围匹配时，本地 Qwen 使用有界热词上下文。热词只提高识别概率，不保证命中。

# general.vocabularyKind
source: Rule type
zh_hans: 规则类型

# general.vocabularyLocale
source: Language scope
zh_hans: 语言范围

# general.vocabularyMatchMode
source: Match mode
zh_hans: 匹配方式

# general.vocabularyPattern
source: Spoken or recognized phrase
zh_hans: 口述或识别到的词

# general.vocabularyPriority
source: Priority
zh_hans: 优先级

# general.vocabularyReplacement
source: Preferred output
zh_hans: 期望输出

# general.vocabularyScope
source: Scope
zh_hans: 作用范围

# general.vocabularyTitle
source: Vocabulary & Mappings
zh_hans: 词汇与映射词

# general.voiceFailureDetailsLabel
source: Details
zh_hans: 详细原因

# general.voiceFailureDismiss
source: Dismiss
zh_hans: 忽略

# general.voiceFailureGenericSummary
source: The last voice run failed. Review the details below.
zh_hans: 上次语音运行失败。请查看下方详细原因。

# general.voiceFailureOpenRecognitionSettings
source: Open Recognition Settings
zh_hans: 打开识别设置

# general.voiceFailureTitle
source: Voice Run Needs Attention
zh_hans: 语音运行需要处理

# general.voiceModeOutputNone
source: No output
zh_hans: 无输出

# general.workflowAdvancedTextSteps
source: Advanced Text Steps
zh_hans: 高级文本步骤

# general.workflowLanguageAuto
source: Auto language
zh_hans: 自动语言

# general.workflowLanguageOverride
source: Language override
zh_hans: 语言覆盖

# general.workflowLocalSpeechModelOverride
source: Local model override
zh_hans: 本地模型覆盖

# general.workflowRouteAutomaticHint
source: Uses the current global engine, with this workflow's language/model overrides when set.
zh_hans: 使用当前全局引擎；如已设置，则应用此工作流自己的语言/模型覆盖。

# general.workflowRouteLocalHint
source: Local speech worker; the workflow's model and language stay on this Mac.
zh_hans: 使用本地语音 worker；workflow 的模型和语言处理留在本机。

# general.workflowSpeechRoute
source: Speech Route
zh_hans: 语音路径

# general.workflowTextStyle
source: Text Style
zh_hans: 文字风格

# general.workflowTextStyleHint
source: Choose what Rill should do with your words before output.
zh_hans: 选择 Rill 在输出前如何处理你的语音文本。

# history.duration.milliseconds
source: %@ ms
zh_hans: %@ 毫秒

# history.duration.seconds
source: %@ s
zh_hans: %@ 秒

# history.maintenance.result
source: Removed %1$@ local record(s); preserved %2$@ active record(s).
zh_hans: 已移除 %1$@ 条本地记录；保留 %2$@ 条活跃记录。

# history.step.duration
source: Processing time: %@
zh_hans: 处理耗时：%@

# history.step.status.cancelled
source: Cancelled
zh_hans: 已取消

# history.step.status.completed
source: Completed
zh_hans: 已完成

# history.step.status.elseBranch
source: Condition not matched
zh_hans: 不满足条件

# history.step.status.failed
source: Failed
zh_hans: 失败

# history.step.status.skipped
source: Skipped; text retained
zh_hans: 已跳过，保留原文

# history.step.status.thenBranch
source: Condition matched
zh_hans: 满足条件

# history.step.status.unchanged
source: Text unchanged
zh_hans: 文本未变化

# history.step.title.applyVocabulary
source: Vocabulary replacement
zh_hans: 词替换

# history.step.title.llmRewrite
source: Text cleanup
zh_hans: 文本润色

# history.step.title.recognizeSpeech
source: Recognized text
zh_hans: 识别结果

# history.step.tokens.missing
source: Not provided
zh_hans: 未提供

# history.step.tokens.unavailable
source: Token usage: %@
zh_hans: Token 用量：%@

# history.step.tokens.usage
source: Tokens · Input %1$@ · Output %2$@ · Total %3$@
zh_hans: Tokens · 输入 %1$@ · 输出 %2$@ · 合计 %3$@

# historyRetentionPeriod.forever
source: Forever
zh_hans: 永久保留

# historyRetentionPeriod.oneDay
source: 1 day
zh_hans: 1 天

# historyRetentionPeriod.oneWeek
source: 1 week
zh_hans: 1 周

# historyRetentionPeriod.oneYear
source: 1 year
zh_hans: 1 年

# historyRetentionPeriod.thirtyDays
source: 30 days
zh_hans: 30 天

# historyRunDetail.collapseDetails
source: Collapse details
zh_hans: 收起详情

# historyRunDetail.details
source: Execution details & diagnostics
zh_hans: 执行详情与诊断

# historyRunDetail.diagnostics
source: Diagnostics
zh_hans: 诊断

# historyRunDetail.languageModel
source: Answer API
zh_hans: 回答 API

# historyRunDetail.legacyDiagnostics
source: This older entry has no run ID to link diagnostics.
zh_hans: 这条旧记录没有运行标识，无法关联诊断。

# historyRunDetail.noDiagnosticIssues
source: No warnings or errors.
zh_hans: 没有警告或错误。

# historyRunDetail.noDiagnostics
source: No retained diagnostics for this run.
zh_hans: 没有保留本次运行的诊断记录。

# historyRunDetail.notRecorded
source: Not recorded
zh_hans: 未记录

# historyRunDetail.polishing
source: Polishing API
zh_hans: 润色 API

# historyRunDetail.recording
source: Recording length
zh_hans: 录音时长

# historyRunDetail.showDiagnosticIssues
source: Show issues only
zh_hans: 仅显示问题

# historyRunDetail.textResults
source: Text processing results
zh_hans: 文本处理结果

# historyRunDetail.transcription
source: Speech to text
zh_hans: 语音转文字

# historyRunDurationBucket.m1Plus
source: 1 min or more
zh_hans: 1 分钟以上

# historyRunDurationBucket.ms250To999
source: 250–999 ms
zh_hans: 250–999 毫秒

# historyRunDurationBucket.s15To59
source: 15–59 s
zh_hans: 15–59 秒

# historyRunDurationBucket.s1To4
source: 1–4 s
zh_hans: 1–4 秒

# historyRunDurationBucket.s5To14
source: 5–14 s
zh_hans: 5–14 秒

# historyRunDurationBucket.unavailable
source: duration unavailable
zh_hans: 耗时不可用

# historyRunDurationBucket.under250ms
source: under 250 ms
zh_hans: 少于 250 毫秒

# historyRunStatus.cancelled
source: Cancelled
zh_hans: 已取消

# historyRunStatus.completed
source: Completed
zh_hans: 已完成

# historyRunStatus.failed
source: Failed
zh_hans: 失败

# historyRunStatus.partiallyCompleted
source: Partially completed
zh_hans: 部分完成

# historyRunStatus.skipped
source: Skipped
zh_hans: 已跳过

# historyRunTrigger.failedAudioRecovery
source: Audio recovery
zh_hans: 录音恢复

# historyRunTrigger.hotkey
source: Hotkey
zh_hans: 快捷键

# historyRunTrigger.manual
source: Manual
zh_hans: 手动

# historyRunTrigger.menuBar
source: Menu bar
zh_hans: 菜单栏

# historyRunTrigger.recordCollectionEvent
source: Collection event
zh_hans: 记录集事件

# historyRunTrigger.recordDelivery
source: Record delivery
zh_hans: 记录投递

# historyRunTrigger.recordReplay
source: Record replay
zh_hans: 记录重放

# historyRunTrigger.recordUse
source: Record use
zh_hans: 记录使用

# historyRunTrigger.wakeWord
source: Wake word
zh_hans: 唤醒词

# historySettings.cancel
source: Cancel
zh_hans: 取消

# historySettings.clearClipboard
source: Clear Record History…
zh_hans: 清除记录历史…

# historySettings.clearClipboardConfirmation
source: Remove eligible records now?
zh_hans: 现在移除可清理的记录吗？

# historySettings.clearClipboardConfirmationDetail
source: Unprotected records are removed. Pinned records and records with an active membership or delivery lease remain available.
zh_hans: 将移除未受保护的记录；置顶记录及拥有活跃成员关系或投递租约的记录会继续保留。

# historySettings.clearRun
source: Clear Run & Diagnostic History…
zh_hans: 清除运行与诊断历史…

# historySettings.clearRunConfirmation
source: Remove all run and diagnostic history now?
zh_hans: 现在移除全部运行与诊断历史吗？

# historySettings.clearRunConfirmationDetail
source: Run records and diagnostics are removed. Records and collections are not changed.
zh_hans: 将移除运行记录与诊断；记录和记录集不会改变。

# historySettings.description
source: Choose how long local records, run history, and diagnostics are kept. Cleanup can be retried if storage is temporarily unavailable.
zh_hans: 分别设置本地记录、运行历史与诊断的保留时长；存储暂时不可用时可以重试清理。

# historySettings.maintenancePending
source: Local history cleanup is pending.
zh_hans: 本地历史清理尚待完成。

# historySettings.maintenanceRunning
source: Updating local history…
zh_hans: 正在更新本地历史…

# historySettings.preservedClipboardDetail
source: Clearing does not remove pinned records or records with an active membership or delivery lease.
zh_hans: 清除操作不会移除置顶记录，以及拥有活跃成员关系或投递租约的记录。

# historySettings.preservedRunDetail
source: Run and diagnostic history is independent from Records and Collections.
zh_hans: 运行与诊断历史和记录、记录集相互独立。

# historySettings.recordRetention
source: Records
zh_hans: 记录

# historySettings.retry
source: Retry Cleanup
zh_hans: 重试清理

# historySettings.runActiveHint
source: Finish the active or queued voice run before clearing run and diagnostic history.
zh_hans: 请先完成当前或排队中的语音运行，再清除运行与诊断历史。

# historySettings.runRetention
source: Run & diagnostic history
zh_hans: 运行与诊断历史

# historySettings.title
source: Local Data & Retention
zh_hans: 本地数据与留存

# historyTimeline.actionDetailsTruncated
source: Additional action details were omitted.
zh_hans: 其余动作详情已省略。

# historyTimeline.actionFormat
source: Action %d
zh_hans: 动作 %d

# historyTimeline.copyFailureDetails
source: Copy failure details
zh_hans: 复制失败详情

# historyTimeline.executionDetailsUnavailable
source: Execution details are unavailable for this older run.
zh_hans: 这条较早的运行没有可用的执行详情。

# historyTimeline.llmAnswer
source: LLM answer
zh_hans: LLM 回答

# historyTimeline.llmRequest
source: LLM request
zh_hans: LLM 请求

# historyTimeline.llmRequestStepFormat
source: LLM request · Step %d
zh_hans: LLM 请求 · 第 %d 步

# historyTimeline.model
source: Model
zh_hans: 模型

# historyTimeline.provider
source: Provider
zh_hans: 提供商

# historyTimeline.recognizedInputLegacy
source: Recognized input (older record)
zh_hans: 识别输入（旧记录）

# historyTimeline.returnedText
source: Returned text
zh_hans: 返回文本

# historyTimeline.sentMessageFormat
source: Sent message · %@ %d
zh_hans: 发送消息 · %@ %d

# historyTimeline.sentToLLM
source: Sent to LLM
zh_hans: 发送给 LLM

# historyTimeline.sentToLLMStepFormat
source: Sent to LLM · Step %d
zh_hans: 发送给 LLM · 第 %d 步

# historyTimeline.systemPrompt
source: System prompt
zh_hans: 系统提示词

# historyTimeline.workflowPrompt
source: Workflow prompt
zh_hans: 工作流提示词

# historyTimeline.workflowRunFallback
source: Workflow run
zh_hans: 工作流运行

# historyTimelineMessageRole.assistant
source: Assistant
zh_hans: 助手

# historyTimelineMessageRole.user
source: User
zh_hans: 用户

# hotkey.generic
source: Hotkey
zh_hans: 快捷键

# hotkey.holdFn
source: Hold Fn
zh_hans: 按住 Fn

# inputMethod.activationHelp
source: In System Settings → Keyboard → Text Input → Edit, click + and add Rill. If Rill is missing, log out and back in, then add it. No reinstallation is needed.
zh_hans: 在系统设置 → 键盘 → 文字输入 → 编辑中，点 + 搜索并添加 Rill。如果搜不到，请注销并重新登录后再添加，无需重复安装。

# inputMethod.chooseApps
source: Choose Apps Allowed to Learn…
zh_hans: 选择允许学习的应用…

# inputMethod.clearPending
source: Clear Unconfirmed Suggestions
zh_hans: 清空未确认建议

# inputMethod.confirm
source: Confirm
zh_hans: 确认

# inputMethod.confirmed
source: Confirmed
zh_hans: 已确认

# inputMethod.deleteSuggestion
source: Delete Suggestion
zh_hans: 删除建议

# inputMethod.description
source: Includes a compact Pinyin dictionary and keeps its own settings and vocabulary. Squirrel can keep running during installation or repair.
zh_hans: 自带轻量全拼词库，独立保存配置与个人词库。普通安装和修复无需退出鼠须管。

# inputMethod.error.learningUnavailable
source: Input method learning is unavailable; capture has not started. Reopen Rill and try again.
zh_hans: 输入法学习暂不可用，未开始采集。重新打开 Rill 后重试。

# inputMethod.error.maintenanceFailed
source: Vocabulary suggestions could not be organized. Try again.
zh_hans: 词汇建议暂时无法整理，请重试。

# inputMethod.error.revokeFailed
source: This vocabulary entry could not be revoked. Try again.
zh_hans: 无法撤销这条词汇，请重试。

# inputMethod.error.saveFailed
source: The vocabulary entry could not be saved. The suggestion is retained; try again.
zh_hans: 词汇未能保存，建议仍保留，请重试。

# inputMethod.error.settingsUnsaved
source: Input method settings have not been saved. Try again.
zh_hans: 输入法设置尚未保存，请重试。

# inputMethod.ignore
source: Ignore
zh_hans: 忽略

# inputMethod.importNotice
source: On first installation, you can import an existing profile and its full personal dictionary. Quit Squirrel before copying to avoid concurrent database writes. The original stays intact; both input methods can then run independently.
zh_hans: 仅首次安装可导入已有方案和完整个人词库。复制词库前需退出鼠须管，避免数据库仍在写入。原目录保留，之后两者可独立使用。

# inputMethod.importPanel
source: For dictionary import, switch to ABC and quit Squirrel to avoid copying an active database. Select the Rime profile folder; the original will be preserved.
zh_hans: 仅导入词库需要切换到 ABC 并退出鼠须管，以免复制正在写入的数据库。选择 Rime 配置目录，原目录会保留。

# inputMethod.importProfile
source: Import from Squirrel and Install…
zh_hans: 从鼠须管导入并安装…

# inputMethod.install
source: Install Rill Input Method
zh_hans: 安装 Rill 输入法

# inputMethod.installing
source: Installing…
zh_hans: 正在安装…

# inputMethod.learnFromTyping
source: Suggest vocabulary from typing
zh_hans: 从打字生成词汇建议

# inputMethod.learnNotice
source: Only the apps you select below are collected. Vocabulary is extracted on this Mac and used for speech recognition after you confirm it. Unconfirmed suggestions are kept for 30 days.
zh_hans: 仅采集下方选定的应用。在本机提取词汇，确认后才供语音识别使用；未确认建议保留 30 天。

# inputMethod.openSettings
source: Open System Input Source Settings
zh_hans: 打开系统输入法设置

# inputMethod.remove
source: Remove
zh_hans: 移除

# inputMethod.repair
source: Repair Installation (Keep Vocabulary)
zh_hans: 修复安装（保留词库）

# inputMethod.revokeVocabulary
source: Revoke Vocabulary
zh_hans: 撤销词汇

# inputMethod.sectionTitle
source: Input Method
zh_hans: 输入法

# inputMethodState.enabled
source: Added to system input sources; select Rill in the menu bar
zh_hans: 已添加到系统输入源，可在菜单栏选择 Rill

# inputMethodState.needsRepair
source: Installation is incomplete. Repair it to continue; your vocabulary will be preserved.
zh_hans: 安装未完成，请修复安装。现有词库会保留。

# inputMethodState.notInstalled
source: Not installed
zh_hans: 尚未安装

# inputMethodState.registered
source: Installed; add Rill to system input sources
zh_hans: 已安装，待添加到系统输入源

# inputMethodState.registrationPending
source: Component installed; log out and back in for macOS to recognize it.
zh_hans: 组件已安装，等待系统识别；请注销并重新登录。

# inputMethodState.selected
source: Rill is the current input source
zh_hans: 正在使用 Rill 输入法

# interface.accessibility
source: Accessibility
zh_hans: 辅助功能

# interface.ambiguousText
source: Ambiguous text
zh_hans: 歧义文本

# interface.appNotListedHint
source: If the app is not listed in Privacy settings yet, click Request Access once first. The system only adds it after an authorization prompt has been requested.
zh_hans: 如果你还没在隐私权限列表里看到这个应用，请先点一次“请求授权”。系统通常会在触发授权提示后才把它加入列表。

# interface.appSubtitle
source: Hands-free writing with voice workflows, clipboard history, and fast replay.
zh_hans: 用语音工作流、剪贴板历史和快速重放来更高效地输入内容。

# interface.applySelection
source: Apply Selection
zh_hans: 应用当前选择

# interface.builtinPushToTalkOutputMode
source: Output
zh_hans: 输出方式

# interface.candidateResolution
source: Candidate Resolution
zh_hans: 候选词消歧

# interface.candidateResolutionHint
source: Review ambiguous spans before the workflow continues.
zh_hans: 在工作流继续之前，请先确认这些存在歧义的词。

# interface.clipboardAddTag
source: Add tag
zh_hans: 添加标签

# interface.clipboardAlternatives
source: Related Variants
zh_hans: 相关变体

# interface.clipboardAppAssignments
source: App Assignments
zh_hans: 应用归组

# interface.clipboardAppAssignmentsEmpty
source: No app assignments yet.
zh_hans: 还没有应用归组。

# interface.clipboardAssignedGroup
source: Assigned Group
zh_hans: 所属分组

# interface.clipboardCaptureDisabledDescription
source: Existing history remains available in the main window. New external copies are not captured, and the global panel shortcut is off.
zh_hans: 现有历史仍可从主窗口访问；新的外部复制内容不会被捕获，全局面板快捷键也已停用。

# interface.clipboardCaptureDisabledTitle
source: Automatic clipboard capture is off
zh_hans: 剪贴板自动捕获已关闭

# interface.clipboardCaptureEnable
source: Turn On Capture
zh_hans: 开启捕获

# interface.clipboardClearSearch
source: Clear record search
zh_hans: 清除记录搜索

# interface.clipboardCreate
source: Create
zh_hans: 创建

# interface.clipboardCreateGroup
source: New Group
zh_hans: 新建分组

# interface.clipboardCrossGroupFallback
source: Allow as cross-group fallback
zh_hans: 允许跨组回退粘贴

# interface.clipboardCrossGroupFallbackHint
source: When enabled, this group is used only after the focused app's own group has no pending item.
zh_hans: 启用后，只有当前应用所属分组没有待粘贴条目时，才会回退使用这个分组。

# interface.clipboardDefaultGroup
source: Unassigned / Default Fallback
zh_hans: 未分组 / 默认回退

# interface.clipboardDeleteItem
source: Delete
zh_hans: 删除

# interface.clipboardDescription
source: Review clipboard groups, assign apps into a single group, and replay any item through a workflow.
zh_hans: 查看剪贴板分组，把应用归入唯一分组，并把任意条目重新交给工作流处理。

# interface.clipboardEmpty
source: No records yet.
zh_hans: 暂无记录。

# interface.clipboardGroupPreviewEmpty
source: No pending item in this group.
zh_hans: 这个分组里还没有待粘贴的条目。

# interface.clipboardGroups
source: Groups
zh_hans: 分组

# interface.clipboardGroupsEmpty
source: No groups yet.
zh_hans: 还没有分组。

# interface.clipboardHistory
source: Items
zh_hans: 条目

# interface.clipboardHistoryAllItems
source: All
zh_hans: 全部

# interface.clipboardHistoryRemainingOnly
source: Remaining
zh_hans: 剩余

# interface.clipboardMergeSimilar
source: Merge similar text
zh_hans: 合并相似文本

# interface.clipboardMergeSimilarHint
source: When enabled, nearby text variants with small spacing, case, or punctuation differences are shown as one history entry.
zh_hans: 开启后，只有大小写、空格或标点差异的文本会合并显示为一条历史记录。

# interface.clipboardMergedSimilarBadge
source: Similar
zh_hans: 相似合并

# interface.clipboardNewGroupName
source: Group name
zh_hans: 分组名称

# interface.clipboardNoPinnedItems
source: No pinned records match the current filters.
zh_hans: 没有匹配当前筛选条件的置顶记录。

# interface.clipboardNoResults
source: No records match this search.
zh_hans: 没有匹配当前搜索的记录。

# interface.clipboardPasteMode
source: Paste mode
zh_hans: 粘贴模式

# interface.clipboardPinItem
source: Pin
zh_hans: 置顶

# interface.clipboardPinnedBadge
source: Pinned
zh_hans: 已置顶

# interface.clipboardPinnedOnly
source: Show pinned items only
zh_hans: 仅显示置顶条目

# interface.clipboardRemoveTag
source: Remove tag
zh_hans: 移除标签

# interface.clipboardReplaceWithWorkflow
source: Replace with Workflow
zh_hans: 用工作流覆盖

# interface.clipboardRouting
source: Groups
zh_hans: 分组

# interface.clipboardSearch
source: Search records
zh_hans: 搜索记录

# interface.clipboardSection
source: Records section
zh_hans: 记录页面区域

# interface.clipboardSelectItem
source: Select an item to preview it, run a workflow, or paste it.
zh_hans: 选择一个条目即可预览、运行工作流或直接粘贴。

# interface.clipboardSystemSourceFallback
source: System clipboard
zh_hans: 系统剪贴板

# interface.clipboardTags
source: Tags
zh_hans: 标签

# interface.clipboardTitle
source: Clipboard History
zh_hans: 剪贴板历史

# interface.clipboardUnpinItem
source: Unpin
zh_hans: 取消置顶

# interface.clipboardWorkflowSourceFallback
source: Rill workflow
zh_hans: Rill 工作流

# interface.commandVHint
source: Copy and paste work normally. Rill records clipboard history in the background; open the clipboard panel to explicitly copy or paste a saved item.
zh_hans: 复制和粘贴保持系统原有行为。Rill 在后台记录剪贴板历史；打开面板后，可手动复制或粘贴历史条目。

# interface.copy
source: Copy
zh_hans: 复制

# interface.deliverNextRecord
source: Deliver Next Record
zh_hans: 投递下一条记录

# interface.deliveryStack
source: Record Queue
zh_hans: 记录队列

# interface.diagnosticsDescription
source: Validate your speech setup and inspect recent runtime events.
zh_hans: 检查语音配置是否正常，并查看最近的运行事件。

# interface.diagnosticsEmpty
source: No persisted diagnostics yet.
zh_hans: 还没有持久化诊断信息。

# interface.diagnosticsLoadFailed
source: Diagnostics could not be loaded from local storage.
zh_hans: 无法从本地存储加载诊断信息。

# interface.diagnosticsLoading
source: Loading diagnostics…
zh_hans: 正在加载诊断信息…

# interface.diagnosticsRetry
source: Retry
zh_hans: 重试

# interface.diagnosticsTimeline
source: Runtime Timeline
zh_hans: 运行时间线

# interface.diagnosticsTitle
source: Diagnostics
zh_hans: 诊断

# interface.dismiss
source: Dismiss
zh_hans: 取消

# interface.eventFeed
source: Activity
zh_hans: 活动

# interface.eventFeedEmpty
source: No events yet. Run a workflow to see activity here.
zh_hans: 暂无事件。运行工作流后，活动将显示在此处。

# interface.globalInput
source: Global Input
zh_hans: 全局输入

# interface.historyDescription
source: Review recently loaded workflow attempts, including results, failures, cancellations, skips, clipboard runs, and execution details.
zh_hans: 查看最近加载的工作流尝试，包括结果、失败、取消、跳过、剪贴板运行与执行详情。

# interface.historyEmpty
source: No runs yet. Run a workflow to see results here.
zh_hans: 还没有运行记录。运行一个工作流后结果会显示在这里。

# interface.historyEntryExpiredDescription
source: This run was removed by retention or cleanup and can no longer be opened.
zh_hans: 该运行记录已被保留策略或清理操作移除，无法再打开。

# interface.historyEntryExpiredTitle
source: Run no longer available
zh_hans: 运行记录已不可用

# interface.historyLoadFailedDescription
source: Rill couldn't read your saved run history. Your data was not replaced; try loading it again.
zh_hans: Rill 无法读取已保存的运行历史。现有数据未被替换，请重试加载。

# interface.historyLoadFailedTitle
source: Run history is unavailable
zh_hans: 运行历史暂不可用

# interface.historyLoadSessionOnlyDescription
source: Rill is running session-only, so reopening saved history cannot succeed until persistent storage is available.
zh_hans: Rill 当前仅在本次会话中运行；在持久化存储恢复前，重新加载已保存历史不会成功。

# interface.historyLoadSessionOnlyTitle
source: Saved history is unavailable
zh_hans: 已保存的历史记录不可用

# interface.historyLoadSessionOnlyViewStorage
source: View Storage Settings
zh_hans: 查看存储设置

# interface.historyLoading
source: Loading run history…
zh_hans: 正在加载运行历史…

# interface.historyNewRunsAvailable
source: New runs are available
zh_hans: 有新的运行记录

# interface.historyNewerPage
source: Newer
zh_hans: 较新

# interface.historyOlderPage
source: Older
zh_hans: 较早

# interface.historyPageEmpty
source: No runs remain on this page. Go to a newer page or refresh the latest history.
zh_hans: 此页已没有保留的运行记录。请前往较新页面或刷新最新历史。

# interface.historyPaginationFailed
source: This page couldn't be loaded. The current page is unchanged.
zh_hans: 无法加载该页，当前页面保持不变。

# interface.historyRefreshNewest
source: Show Newest
zh_hans: 查看最新记录

# interface.historyRetryLoad
source: Try Again
zh_hans: 重试

# interface.historyScopeAll
source: Recent Runs
zh_hans: 最近运行

# interface.historyScopeLabel
source: Run history view
zh_hans: 运行历史视图

# interface.historyStackBadge
source: Clipboard
zh_hans: 剪贴板

# interface.language
source: Language
zh_hans: 界面语言

# interface.latestOutput
source: Recent Results
zh_hans: 最近结果

# interface.legacyWhisperKitCustomModel
source: Custom Model ID
zh_hans: 自定义模型 ID

# interface.legacyWhisperKitCustomModelHint
source: Only release-pinned MLX models are accepted.
zh_hans: 仅接受由当前版本固定并校验的 MLX 模型。

# interface.legacyWhisperKitCustomModelRequired
source: Choose a supported local model first.
zh_hans: 请先选择受支持的本地模型。

# interface.legacyWhisperKitLanguage
source: Default Language
zh_hans: 默认语言

# interface.legacyWhisperKitModelFolder
source: Model Folder
zh_hans: 模型目录

# interface.legacyWhisperKitModelRepo
source: Model Repository
zh_hans: 模型仓库

# interface.legacyWhisperKitModelToken
source: Access Token
zh_hans: 访问令牌

# interface.liveSubtitleClose
source: Close live subtitle
zh_hans: 关闭实时字幕

# interface.localSpeechArchitectureUnsupported
source: This build does not include a compatible MLX speech worker. Use a supported Rill build.
zh_hans: 此构建未包含兼容的 MLX 语音 worker，请使用受支持的 Rill 构建。

# interface.localSpeechAutoDownload
source: Download model automatically when needed
zh_hans: 在需要时自动下载模型

# interface.localSpeechCancelPreparation
source: Cancel
zh_hans: 取消

# interface.localSpeechDownloaded
source: Downloaded
zh_hans: 已下载

# interface.localSpeechDownloadedModels
source: Downloaded Models
zh_hans: 已下载模型

# interface.localSpeechFinalizing
source: Loading the model and compiling first-run Metal resources...
zh_hans: 正在加载模型并编译首次运行所需的 Metal 资源...

# interface.localSpeechLocalTestHint
source: Record through the selected local model and save the transcript to the Speech Recognition group.
zh_hans: 使用所选本地模型录音，并将转写结果保存到“语音识别”分组。

# interface.localSpeechModel
source: Final Transcription Model
zh_hans: 最终转写模型
